---
kind: method
id: M:Autodesk.Revit.DB.Transform1D.OfPoint(System.Double)
source: html/cc9a6547-a08e-99d0-2970-2b816ed1e579.htm
---
# Autodesk.Revit.DB.Transform1D.OfPoint Method

Applies the transformation to the 1-dimensional point and returns the result.

## Syntax (C#)
```csharp
public double OfPoint(
	double point
)
```

## Parameters
- **point** (`System.Double`) - The point to transform.

## Returns
The transformed point.

## Remarks
Transformation of a point is affected by the translational part of the transformation.